================================================================================
Integers
================================================================================

123;
-123;
!123;

--------------------------------------------------------------------------------

(program
  (expression_statement
    (integer))
  (expression_statement
    (prefix_expression
      (integer)))
  (expression_statement
    (prefix_expression
      (integer))))


================================================================================
Strings
================================================================================

"hello world";

--------------------------------------------------------------------------------

(program
  (expression_statement
    (string)))

================================================================================
Booleans
================================================================================

true;
false;
!true;

--------------------------------------------------------------------------------

(program
  (expression_statement
    (true))
  (expression_statement
    (false))
  (expression_statement
    (prefix_expression
     (true))))


================================================================================
Function Literals
================================================================================

fn(x, y) { x + y }
fn() { return "hello"; }
fn(x) { x }

--------------------------------------------------------------------------------
(program
  (expression_statement
    (function_literal
      parameters: (parameters
        (identifier)
        (identifier))
      body: (block_statement
        (expression_statement
          (infix_expression
            left: (identifier)
            right: (identifier))))))
  (expression_statement
    (function_literal
      parameters: (parameters)
      body: (block_statement
        (return_statement
          (string)))))
  (expression_statement
    (function_literal
      parameters: (parameters
        (identifier))
      body: (block_statement
        (expression_statement
          (identifier))))))

